---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctSettings.AirViscosity
source: html/6c77b0f7-1565-e199-eef0-ffadc4714b25.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSettings.AirViscosity Property

The kinematic viscosity of air in ft^2/s.

## Syntax (C#)
```csharp
public double AirViscosity { get; set; }
```